{
  "overviews": {
    "discourse-analysis": "Discourse Analysis, pioneered by Norman Fairclough in the 1980s, examines how language, narratives, and communication patterns shape social reality and constrain or enable futures thinking. Applied to foresight, it reveals how dominant discourses frame what futures are considered possible, desirable, or even thinkable, while marginalizing alternative visions. The method analyzes text, discourse practices, and sociocultural contexts to uncover power relations embedded in language. By deconstructing organizational narratives, policy documents, and media representations of the future, discourse analysis exposes whose voices dominate futures conversations and whose are silenced. This critical lens is essential for inclusive foresight, revealing how seemingly neutral language perpetuates existing power structures and limits imagination of alternatives.",

    "scenarios": "Scenario Planning, developed at Royal Dutch Shell in the 1970s by Pierre Wack, creates multiple plausible narrative descriptions of how the future might unfold, based on different assumptions about key uncertainties and driving forces. Unlike forecasting (which predicts a single future) or visioning (which imagines preferred futures), scenarios explore the space of possibility by asking \"what if?\" Rather than attempting to predict the future, scenarios prepare decision-makers to recognize and respond effectively when different futures emerge. The method identifies critical uncertainties (factors that will significantly impact the future but whose outcomes are unpredictable), constructs 3-4 divergent but plausible scenarios, and uses these narratives to test strategies and surface hidden assumptions. Effective scenarios are not best/worst case, but genuinely different logics of how the future could unfold, each internally consistent and challenging to conventional thinking.",

    "delphi": "The Delphi Method, developed at RAND Corporation in the 1950s by Olaf Helmer and Norman Dalkey, is a structured forecasting technique that builds expert consensus through iterative rounds of anonymous surveys with controlled feedback. Designed to overcome the pitfalls of traditional expert panels (groupthink, dominance by loud voices, pressure to conform), Delphi allows experts to revise their judgments after seeing aggregated group responses without knowing individual opinions. The process typically involves 2-4 rounds: experts provide initial forecasts, receive statistical summary of group responses, reflect on divergence from their own views, and revise estimates. The method is particularly valuable for long-term forecasting (10-30 years) where historical data is limited, for complex socio-technical systems with many interacting factors, and when expert judgment must substitute for empirical evidence. Delphi has been widely used for technology forecasting, policy planning, and strategic foresight.",

    "visioning": "Visioning, formalized by Elise Boulding and others in the 1980s-90s, is a participatory process for creating shared, compelling images of desired futures that guide strategic action toward transformation. Unlike forecasting (which extrapolates trends) or scenario planning (which explores multiple possibilities), visioning asks \"what do we want?\" and uses imagination to articulate aspirational futures that motivate change. The process typically engages diverse stakeholders in facilitated workshops using techniques like \"imaging the future\" (mentally stepping into a preferred future and describing it in present tense), visual mapping, and narrative storytelling. Effective visions are positive and aspirational (not problem-focused), concrete and vivid (not abstract), inclusive (reflecting diverse values), and actionable (guiding strategy). Visioning is particularly powerful for communities, organizations, and movements seeking transformative change rather than incremental improvement, creating emotional connection and shared ownership of preferred futures.",

    "backcasting": "Backcasting, pioneered by John Robinson in the 1980s for energy and sustainability planning, is a strategic planning method that works backward from a defined desirable future to identify pathways and actions needed to reach it. Unlike forecasting (which projects current trends forward) or scenario planning (which explores multiple possibilities), backcasting begins with normative goal-setting: \"What future do we want?\" and then asks \"How do we get there?\" The process defines a specific future state (typically 15-30 years out), describes it in detail, and then traces logical steps backward to the present, identifying necessary changes, decision points, and interventions along the way. Backcasting is especially valuable when: current trends are undesirable and must be disrupted, the problem is complex and requires systemic change, the goal is ambitious and transformative, or dominant interests resist change. It has been widely applied to climate strategy, sustainable cities, and technology transitions.",

    "aspirational-futures": "Aspirational Futures Design, inspired by Gene Roddenberry's Star Trek and advanced by thinkers like Buckminster Fuller and Jacque Fresco, imagines radically optimistic post-scarcity futures where technology, social innovation, and human collaboration solve existential challenges and enable human flourishing. Rather than extrapolating current trends or managing risks, this approach asks \"What is the most inspiring future we can imagine?\" and uses that vision to pull present action toward transformative goals. Star Trek exemplifies this: a future where humanity has transcended war, poverty, and nationalism, united in exploration and self-betterment. Aspirational futures challenge default pessimism in foresight, providing positive visions that motivate action, attract resources, and shift cultural narratives from scarcity to abundance. The method is particularly relevant for addressing civilizational challenges (climate, AI, inequality) where incremental change is insufficient and bold reimagining is needed to inspire transformative action."
  },

  "descriptions": {
    "futures-triangle": "Three competing forces - push of the present, pull of envisioned futures, weight of historical inertia - shaping plausible future trajectories",

    "env-scanning": "Systematic environmental monitoring across STEEP domains (Social, Technological, Economic, Environmental, Political) to detect trends, signals, and emerging changes",

    "weak-signals": "Faint early indicators of potential disruption detected at the periphery before they amplify into mainstream trends or crises",

    "cycle-theory": "Identification and analysis of recurring temporal patterns, cycles, and rhythms in history, economics, demographics, and social change",

    "cla": "Four-layer depth analysis examining litany (events), systems (structures), worldviews (discourses), and myths (metaphors) underlying current and alternative futures",

    "discourse-analysis": "Critical examination of language, narratives, and communication patterns that shape how futures are imagined and whose visions are privileged",

    "scenarios": "Development of multiple plausible divergent future narratives to explore uncertainties, test strategies, and challenge assumptions in complex environments",

    "wild-cards": "Low-probability high-impact events (Black Swans) that could radically disrupt current trajectories and fundamentally reshape the future if they occurred",

    "morphological": "Systematic exploration of all possible combinations of solution parameters to map the complete morphological field of potential futures",

    "delphi": "Structured expert consensus forecasting process using iterative anonymous surveys with controlled feedback to converge on probabilistic predictions",

    "visioning": "Participatory co-creation of shared aspirational images of desired futures to guide strategic action and motivate transformative change"
  }
}
